// server/src/data/sinsal/12sinsal.map.ts

export const SINSAL_12_MAP: { [key: string]: { [key: string]: string } } = {
  寅午戌: {
    寅: "지살",
    卯: "연살",
    辰: "월살",
    巳: "망신살",
    午: "장성살",
    未: "반안살",
    申: "역마살",
    酉: "육해살",
    戌: "화개살",
    亥: "겁살",
    子: "재살",
    丑: "천살",
  },
  巳酉丑: {
    巳: "지살",
    午: "연살",
    未: "월살",
    申: "망신살",
    酉: "장성살",
    戌: "반안살",
    亥: "역마살",
    子: "육해살",
    丑: "화개살",
    寅: "겁살",
    卯: "재살",
    辰: "천살",
  },
  申子辰: {
    申: "지살",
    酉: "연살",
    戌: "월살",
    亥: "망신살",
    子: "장성살",
    丑: "반안살",
    寅: "역마살",
    卯: "육해살",
    辰: "화개살",
    巳: "겁살",
    午: "재살",
    未: "천살",
  },
  亥卯未: {
    亥: "지살",
    子: "연살",
    丑: "월살",
    寅: "망신살",
    卯: "장성살",
    辰: "반안살",
    巳: "역마살",
    午: "육해살",
    未: "화개살",
    申: "겁살",
    酉: "재살",
    戌: "천살",
  },
};

export const getSamhapGroup = (yearJi: string) => {
  if (["寅", "午", "戌"].includes(yearJi)) return "寅午戌";
  if (["巳", "酉", "丑"].includes(yearJi)) return "巳酉丑";
  if (["申", "子", "辰"].includes(yearJi)) return "申子辰";
  if (["亥", "卯", "未"].includes(yearJi)) return "亥卯未";
  return null;
};


